package docbase

/* コピペ用の引数
114
彩りガーデンサラダ 299 130
小エビのサラダ 349 115
やわらかチキンのサラダ 299 134
わかめサラダ 299 92
イタリアンサラダ 299 196
シーフードサラダ 599 229
半熟卵とポークのサラダ 599 433
コーンクリームスープ 149 142
冷たいパンプキンスープ(季節限定) 149 105
たっぷり野菜のミネストローネ(季節限定) 299 222
削りたてペコリーノチーズ 100 59
ミニフィセル 169 188
ガーリックトースト 189 252
セットドリンクバー 190 0
辛味チキン 299 374
アスパラガスのオーブン焼き(季節限定) 299 221
ポップコーンシュリンプ 299 215
エスカルゴのオーブン焼き 399 256
ムール貝のガーリック焼き 399 164
野菜ソースのグリルソーセージ 399 570
チョリソー 399 393
柔らか青豆の温サラダ 199 213
ほうれん草のソテー 199 138
キャベツとアンチョビのソテー 199 80
ポテトのグリル 199 366
セロリのピクルス(季節限定) 199 52
真イカのパプリカソース 199 138
フォッカチオ 119 214
プチフォッカ 139 214
セットプチフォッカ 79 107
グラスワイン 100 0
デカンタ・250ml 200 0
デカンタ・500ml 399 0
キリン一番搾り（ジョッキ） 399 0
キリン一番搾り（グラス） 299 0
ストロングゼロダブルレモン 379 0
マグナム・1500ml 1080 0
グラッパ 379 0
ランブルスコセッコ（赤）辛口 1080 0
ランブルスコ（ロゼ）甘口 1080 0
ベルデッキオ（辛口・中） 1080 0
キャンティ（辛口・やや重い） 1080 0
キャンティルフィナリゼルパ（辛口・重い） 2160 0
サイゼリヤプレミアム（辛口・重い） 2160 0
サントリーオールフリー 259 0
フレッシュチーズとトマトのサラダ 299 203
フレッシュチーズとトマトのサラダ(Wサイズ) 598 406
プロシュート 399 162
プロシュート(Wサイズ) 798 324
熟成ミラノサラミ 299 95
熟成ミラノサラミ(Wサイズ) 598 190
マルゲリータピザ 399 568
パンチェッタのピザ 399 646
野菜ときのこのピザ 399 610
やわらかイカのアンチョビのピザ 499 593
バッファローモッツァレラのピザ 499 575
ミラノサラミのピザ 499 606
ほうれん草のグラタン(季節限定) 399 521
シーフードグラタン 499 537
アラビアータ 399 591
ミートソースボロニア風 399 582
半熟卵のミートソースボロニア風 468 672
アーリオ・オーリオ 299 560
キャベツのペペロンチーノ 399 686
タラコソースシシリー風 399 605
スープ入りトマト味ボンゴレ(季節限定) 499 686
パルマ風スパゲッティ 399 700
イカの墨入りスパゲッティ 499 610
カルボナーラ 499 865
アスパラガスとエビのクリームスパゲッティ(季節限定) 499 711
アラビアータ(Wサイズ) 770 1182
ミートソースボロニア風(Wサイズ) 770 1164
アーリオ・オーリオ(Wサイズ) 574 1120
キャベツのペペロンチーノ(Wサイズ) 770 1372
タラコソースシシリー風(Wサイズ) 770 1210
パルマ風スパゲッティ(Wサイズ) 770 1400
イカの墨入りスパゲッティ(Wサイズ) 976 1220
カルボナーラ(Wサイズ) 976 1730
アスパラガスとエビのクリームスパゲッティ(季節限定)(Wサイズ) 976 1422
トッピング半熟卵 69 90
ミラノ風ドリア 299 542
半熟卵のミラノ風ドリア 368 632
セットプチフォッカ付きミラノ風ドリア 378 649
いろどり野菜のミラノ風ドリア 399 590
エビとイカのドリア 499 624
シーフードパエリア 599 602
エビと野菜のトマトクリームリゾット 399 302
ハヤシ&ターメリックライス 499 638
半熟卵のハヤシ＆ターメリックライス 568 728
ミックスグリル 599 823
ハンバーグステーキ 399 514
デミグラスソースのハンバーグ 499 628
野菜ソースのハンバーグ(ディアボラ風) 499 585
イタリアンハンバーグ 499 633
焼肉とハンバーグの盛合せ 599 709
若鶏のグリル(ディアボラ風) 499 541
柔らかチキンのチーズ焼き 499 588
パンチェッタと若鶏のグリル 599 663
リブステーキ 999 621
ライス 169 303
ラージライス 219 454
スモールライス 119 151
カプチーノ(アイスケーキ)(季節限定) 199 114
ティラミス(アイスケーキ) 199 131
シナモンフォッカチオ 169 246
プリンとカプチーノの盛合せ 399 330
プリンとティラミスの盛合せ 399 347
ミルクアイスのせシナモンフォッカチオ 319 346
ミルクジェラート 199 100
シチリア産レモンのソルベ 199 127
イタリアンプリン 249 216
チョコレートケーキ 299 166
コーヒーゼリー 299 162
トリフアイスクリーム 369 164


110
彩りガーデンサラダ 299 130
小エビのサラダ 349 115
やわらかチキンのサラダ 299 134
わかめサラダ 299 92
イタリアンサラダ 299 196
シーフードサラダ 599 229
半熟卵とポークのサラダ 599 433
コーンクリームスープ 149 142
冷たいパンプキンスープ(季節限定) 149 105
たっぷり野菜のミネストローネ(季節限定) 299 222
削りたてペコリーノチーズ 100 59
ミニフィセル 169 188
ガーリックトースト 189 252
セットドリンクバー 190 0
辛味チキン 299 374
アスパラガスのオーブン焼き(季節限定) 299 221
ポップコーンシュリンプ 299 215
エスカルゴのオーブン焼き 399 256
ムール貝のガーリック焼き 399 164
野菜ソースのグリルソーセージ 399 570
チョリソー 399 393
柔らか青豆の温サラダ 199 213
ほうれん草のソテー 199 138
キャベツとアンチョビのソテー 199 80
ポテトのグリル 199 366
セロリのピクルス(季節限定) 199 52
真イカのパプリカソース 199 138
フォッカチオ 119 214
プチフォッカ 139 214
セットプチフォッカ 79 107
グラスワイン 100 0
デカンタ・250ml 200 0
デカンタ・500ml 399 0
キリン一番搾り（ジョッキ） 399 0
キリン一番搾り（グラス） 299 0
ストロングゼロダブルレモン 379 0
マグナム・1500ml 1080 0
グラッパ 379 0
ランブルスコセッコ（赤）辛口 1080 0
ランブルスコ（ロゼ）甘口 1080 0
ベルデッキオ（辛口・中） 1080 0
キャンティ（辛口・やや重い） 1080 0
キャンティルフィナリゼルパ（辛口・重い） 2160 0
サイゼリヤプレミアム（辛口・重い） 2160 0
サントリーオールフリー 259 0
フレッシュチーズとトマトのサラダ 299 203
フレッシュチーズとトマトのサラダ(Wサイズ) 598 406
プロシュート 399 162
プロシュート(Wサイズ) 798 324
熟成ミラノサラミ 299 95
熟成ミラノサラミ(Wサイズ) 598 190
マルゲリータピザ 399 568
パンチェッタのピザ 399 646
野菜ときのこのピザ 399 610
やわらかイカのアンチョビのピザ 499 593
バッファローモッツァレラのピザ 499 575
ミラノサラミのピザ 499 606
ほうれん草のグラタン(季節限定) 399 521
シーフードグラタン 499 537
アラビアータ 399 591
ミートソースボロニア風 399 582
半熟卵のミートソースボロニア風 468 672
キャベツのペペロンチーノ 399 686
タラコソースシシリー風 399 605
スープ入りトマト味ボンゴレ(季節限定) 499 686
パルマ風スパゲッティ 399 700
イカの墨入りスパゲッティ 499 610
カルボナーラ 499 865
アスパラガスとエビのクリームスパゲッティ(季節限定) 499 711
アラビアータ(Wサイズ) 770 1182
ミートソースボロニア風(Wサイズ) 770 1164
アーリオ・オーリオ(Wサイズ) 574 1120
キャベツのペペロンチーノ(Wサイズ) 770 1372
タラコソースシシリー風(Wサイズ) 770 1210
パルマ風スパゲッティ(Wサイズ) 770 1400
イカの墨入りスパゲッティ(Wサイズ) 976 1220
カルボナーラ(Wサイズ) 976 1730
アスパラガスとエビのクリームスパゲッティ(季節限定)(Wサイズ) 976 1422
トッピング半熟卵 69 90
ミラノ風ドリア 299 542
半熟卵のミラノ風ドリア 368 632
セットプチフォッカ付きミラノ風ドリア 378 649
いろどり野菜のミラノ風ドリア 399 590
エビとイカのドリア 499 624
シーフードパエリア 599 602
エビと野菜のトマトクリームリゾット 399 302
ハヤシ&ターメリックライス 499 638
半熟卵のハヤシ＆ターメリックライス 568 728
ミックスグリル 599 823
ハンバーグステーキ 399 514
デミグラスソースのハンバーグ 499 628
野菜ソースのハンバーグ(ディアボラ風) 499 585
イタリアンハンバーグ 499 633
焼肉とハンバーグの盛合せ 599 709
若鶏のグリル(ディアボラ風) 499 541
柔らかチキンのチーズ焼き 499 588
パンチェッタと若鶏のグリル 599 663
リブステーキ 999 621
カプチーノ(アイスケーキ)(季節限定) 199 114
ティラミス(アイスケーキ) 199 131
シナモンフォッカチオ 169 246
プリンとカプチーノの盛合せ 399 330
プリンとティラミスの盛合せ 399 347
ミルクアイスのせシナモンフォッカチオ 319 346
ミルクジェラート 199 100
シチリア産レモンのソルベ 199 127
イタリアンプリン 249 216
チョコレートケーキ 299 166
コーヒーゼリー 299 162
トリフアイスクリーム 369 164
*/


fun main() {
    // inputs
    val n = readLine()!!.toInt()
    val menus: List<Menu> =
        (0 until n).map { readLine()!!.split(" ") }.map { Menu(it[0], it[1].toInt(), it[2].toInt()) }

    // logic
    var memo: MutableMap<Int, Set<Menu>> = mutableMapOf()
    fun getMaxCalMenus(remaining: Int): Set<Menu> = memo.getOrPut(remaining, {
        menus.filter { it.price <= remaining }
            .mapNotNull { getMaxCalMenus(remaining - it.price) + it }
            .maxBy { it.sumBy { menu -> menu.cal } }
            ?: run { emptySet<Menu>() }
    })

    // outputs
    val results = getMaxCalMenus(1000)
    println("総額 ${results.sumBy { it.price }} 円")
    println("総カロリー ${results.sumBy { it.cal }} Kcal")
    results.forEach { println(it) }
}

data class Menu(val name: String, val price: Int, val cal: Int) {
    override fun toString(): String {
        return "${name} ${price} 円 ${cal} Kcal"
    }
}
